; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v13)
             (pred_5 ?v11 ?v2)
             (pred_6 ?v10 ?v2)
             (pred_3 ?v4 ?v10 )
	     (pred_1 ?v10)
             (pred_8 ?v9)
             (pred_4 ?v11)
             (pred_2 ?v2)
             (pred_12 ?v10)
             (pred_10 ?v11)
             (pred_11 ?v10)
             (pred_9 ))



(:action op_1
:parameters (?v3 ?v6 ?v5 ?v7)
:precondition (and (pred_8 ?v3) (pred_8 ?v6) (pred_4 ?v5) (pred_2 ?v7)
          (pred_7 ?v3 ?v6) (pred_5 ?v5 ?v7)
                   (pred_6 ?v6 ?v7) (pred_1 ?v3) 
                   (pred_12 ?v6) (pred_10 ?v5))
:effect (and  (pred_11 ?v6) (not (pred_12 ?v6))))


(:action op_5
:parameters (?v3 ?v12)
:precondition (and (pred_8 ?v3) (pred_8 ?v12)
               (pred_1 ?v3) (pred_7 ?v3 ?v12) (pred_11 ?v12))
:effect (and (pred_1 ?v12) (not (pred_1 ?v3))))

(:action op_4
:parameters (?v3 ?v5)
:precondition (and (pred_8 ?v3) (pred_4 ?v5) 
                  (pred_1 ?v3) (pred_3 ?v5 ?v3) (pred_9 ))
:effect (and (pred_10 ?v5)
   (not (pred_3 ?v5 ?v3)) (not (pred_9 ))))


(:action op_3
:parameters (?v3 ?v8 ?v1)
:precondition (and (pred_8 ?v3) (pred_4 ?v8) (pred_4 ?v1)
                  (pred_1 ?v3) (pred_10 ?v1) (pred_3 ?v8 ?v3))
:effect (and (pred_10 ?v8) (pred_3 ?v1 ?v3)
        (not (pred_10 ?v1)) (not (pred_3 ?v8 ?v3))))

(:action op_2
:parameters (?v3 ?v5)
:precondition (and (pred_8 ?v3) (pred_4 ?v5) 
                  (pred_1 ?v3) (pred_10 ?v5))
:effect (and (pred_9 ) (pred_3 ?v5 ?v3) (not (pred_10 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_16 obj_21 obj_08 obj_04 obj_02 obj_13 obj_09 obj_06 obj_12 obj_05 obj_01 obj_14 obj_18 obj_11 obj_07
    obj_10 obj_17
    obj_15 obj_20 obj_19
    )

    (:init
       (pred_9)

       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_11)
       (pred_8 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_17)
       (pred_4 obj_15)
       (pred_4 obj_20)
       (pred_4 obj_19)

       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_21 obj_13)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_04 obj_06)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_09 obj_01)
       (pred_7 obj_09 obj_08)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_04)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_09)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_11)
       (pred_12 obj_07)
       (pred_12 obj_21)
       (pred_12 obj_16)
       (pred_6  obj_07 obj_10)
       (pred_6  obj_21 obj_17)
       (pred_6  obj_16 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_06)
       (pred_11 obj_12)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_14)
       (pred_11 obj_18)
       (pred_11 obj_11)

       (pred_5  obj_15 obj_10)
       (pred_5  obj_20 obj_17)
       (pred_5  obj_19 obj_10)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_19 obj_01)
       (pred_1 obj_01)
    )

    (:goal (and
       (pred_3 obj_15 obj_05)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_19 obj_02)
    ))
(:constraints
  (always (not (pred_1 obj_12)))
)
)

; plan
1. (op_4 obj_01 obj_19)
   deleted: (pred_3 obj_19 obj_01) (pred_9)
   added: (pred_10 obj_19)
   goals met: 0 of 3
2. (op_5 obj_01 obj_05)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_05)
   goals met: 0 of 3
3. (op_5 obj_05 obj_13)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_13)
   goals met: 0 of 3
4. (op_5 obj_13 obj_02)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_02)
   goals met: 0 of 3
5. (op_3 obj_02 obj_20 obj_19)
   deleted: (pred_10 obj_19) (pred_3 obj_20 obj_02)
   added: (pred_10 obj_20) (pred_3 obj_19 obj_02)
   goals met: 1 of 3
6. (op_5 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 1 of 3
7. (op_5 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_06)
   goals met: 1 of 3
8. (op_5 obj_06 obj_14)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_14)
   goals met: 1 of 3
9. (op_5 obj_14 obj_18)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_18)
   goals met: 1 of 3
10. (op_2 obj_18 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_9) (pred_3 obj_20 obj_18)
   goals met: 2 of 3
11. (op_5 obj_18 obj_14)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_14)
   goals met: 2 of 3
12. (op_5 obj_14 obj_06)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_06)
   goals met: 2 of 3
13. (op_4 obj_06 obj_15)
   deleted: (pred_3 obj_15 obj_06) (pred_9)
   added: (pred_10 obj_15)
   goals met: 2 of 3
14. (op_5 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 2 of 3
15. (op_5 obj_04 obj_02)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_02)
   goals met: 2 of 3
16. (op_5 obj_02 obj_13)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_13)
   goals met: 2 of 3
17. (op_5 obj_13 obj_05)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_05)
   goals met: 2 of 3
18. (op_2 obj_05 obj_15)
   deleted: (pred_10 obj_15)
   added: (pred_9) (pred_3 obj_15 obj_05)
   goals met: 3 of 3
